# Conductor Material Create Method

Source: https://www.revitapidocs.com/2026/107a3747-c307-25fc-5fe1-38c3c31417f3.htm

---

| Conductor Material Create Method |
| --- |

Creates a Conductor Material.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ConductorMaterial Create(
	Document document
)
```

```
Public Shared Function Create (
	document As Document
) As ConductorMaterial
```

```
public:
static ConductorMaterial^ Create(
	Document^ document
)
```

```
static member Create :
        document : Document -> ConductorMaterial
```

#### Parameters

document Document
:   The document.

#### Return Value

ConductorMaterial
The newly created Conductor Material data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements).  \-or\-  The document is being loaded, or is in the midst of another  sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace